In [1]:
import MySQLdb

# connect mysql
- db

In [2]:
db = MySQLdb.connect(
    "IP",
    "root",
    "password",
    "db name",
    charset='utf8')
db

# create cursor

In [4]:
cur = db.cursor()

# get columns name

In [10]:
query = """
SHOW columns FROM country
"""
cur.execute(query)

15

In [11]:
columns = cur.fetchall()
for col in columns:
    print(col[0])

Code
Name
Continent
Region
SurfaceArea
IndepYear
Population
LifeExpectancy
GNP
GNPOld
LocalName
GovernmentForm
HeadOfState
Capital
Code2

# select

In [5]:
# query
query = """
SELECT code, name, population
FROM country
"""
cur.execute(query)

239

# create 
- database
- table

In [16]:
query = """
create database city_info_3;
"""
cur.execute(query)

1

In [17]:
query = """
use city_info_3;
"""
cur.execute(query)

0

In [18]:
query = """
CREATE TABLE popular(
    rank int(4),
    city_name varchar(20),
    population int(20)
)
"""
cur.execute(query)

0

# insert

In [20]:
query ="""
INSERT INTO popular (rank, city_name, population)
VALUES  (1, "Seoul", 9900000),
        (2, "Busan", 3500000),
        (3, "Incheon", 2900000);
"""
cur.execute(query)

3

# 동기화
- cur.commit()

In [ ]:
db.commit()

---

# display and db -> pd
- cur.fetchall()
- df = pd.read_sql(query, db)

# 1)

In [6]:
rows = cur.fetchall()
for row in rows[:5]:
    print(row)

('ABW', 'Aruba', 103000)
('AFG', 'Afghanistan', 22720000)
('AGO', 'Angola', 12878000)
('AIA', 'Anguilla', 8000)
('ALB', 'Albania', 3401200)

In [14]:
df = pd.DataFrame(list(rows), columns=["code", "city_name", "population"])
df[:5]

  code    city_name  population
0  ABW        Aruba      103000
1  AFG  Afghanistan    22720000
2  AGO       Angola    12878000
3  AIA     Anguilla        8000
4  ALB      Albania     3401200

# 2)

In [21]:
query = """
SELECT *
FROM popular
"""
cur.execute(query)

3

In [22]:
df = pd.read_sql(query, db)
df

   rank city_name  population
0     1     Seoul     9900000
1     2     Busan     3500000
2     3   Incheon     2900000

---

# pd -> db
- sqlAlchemy version == 1.2.5

In [24]:
from sqlalchemy import create_engine
tips_df = sns.load_dataset("tips")
tips_df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [25]:
engine = create_engine("mysql+mysqldb://root:password@13.209.21.50/city_info_3")
engine

Engine(mysql+mysqldb://root:***@13.209.21.50/city_info_3)

In [26]:
tips_df.to_sql(name='tips', con=engine, if_exists="replace")
db.commit()

In [27]:
query = """
SELECT *
FROM tips;
"""
df = pd.read_sql(query, db)
df.tail()

     index  total_bill   tip     sex smoker   day    time  size
239    239       29.03  5.92    Male     No   Sat  Dinner     3
240    240       27.18  2.00  Female    Yes   Sat  Dinner     2
241    241       22.67  2.00    Male    Yes   Sat  Dinner     2
242    242       17.82  1.75    Male     No   Sat  Dinner     2
243    243       18.78  3.00  Female     No  Thur  Dinner     2

# drop

In [28]:
query = """
drop database city_info_3;
"""
cur = db.cursor()
cur.execute(query)

2

# connection close

In [29]:
db.close()

In [30]:
db